// path
// Вывести в консоль:
// • Название текущ. файла
// • абсолютный путь к текущ. файлу
// • Название текущ. файла без расширения
// • Расширение файла
// • Название текущ. папки
// • Абсолютный путь к текущ. папке
// • Абсолютный путь к НЕтекущ. папке
// • Путь к файлу в соседней папке (абсолютный)
// • Путь к файлу в соседней папке (относительный)

// fs
// • создать папку синхронно
// • создать вложенные папки синхронно рекурсивно
// • создать папку асинхронно
// • создать вложенные папки асинхронно рекурсивно
// • удалить папку через колбэки
// • удалить папку через промисы
// • записать/добавить/прочитать строку в файл синхронно
// • записать/добавить/прочитать строку в файл асинхронно через колбэки
// • записать/добавить/прочитать строку в файл асинхронно через промисы (своя ф-ия)
// • записать/добавить/прочитать строку в файл асинхронно через промисы в кодировке utf-8
// • удалить файл через колбэки
// • удалить файл через промисы
// • Через перемен.окруж-я передаем строку (ytcrjkmrj ckjd), записываем её в файл.
// Считываем файл, считаем кол-во слов в файле и записываем их в другой файл. Первый файл удаляем

// npm
// • как запустить nodemon?

// http
// • создать сервер
// • вывести сообщение в браузер в формате JSON

// events
// • создать событие "message" и вывести сообщение в консоль (генерация события)
// • написать пример однократного события
